## Filtering

In [9]:
import pandas as pd

# Initiate an empty dataframe
df = pd.DataFrame()

# Create a data dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Charlie', 'David', 'Karen'],
    'Age' : [24, 27, 22, 32, 41],
    'Country': ['USA', 'USA', 'UK', 'UK', 'USA']
}

# Create dataframe from dictionary
df = pd.DataFrame(data)

# Show dataframe
df

      Name  Age Country
0    Alice   24     USA
1      Bob   27     USA
2  Charlie   22      UK
3    David   32      UK
4    Karen   41     USA

In [10]:
# Filter dataframe using one condition

df_filtered = df[df ['Age'] > 25 ]
df_filtered

    Name  Age Country
1    Bob   27     USA
3  David   32      UK
4  Karen   41     USA

In [11]:
# Filter dataframe using multiple conditions

# AND operator
df_filtered = df[ (df['Age'] > 25) & (df['Country'] == 'USA')]
df_filtered

    Name  Age Country
1    Bob   27     USA
4  Karen   41     USA

In [12]:
# OR operator
df_filtered = df[ (df['Age'] > 25) | (df['Country'] == 'USA')]
df_filtered

    Name  Age Country
0  Alice   24     USA
1    Bob   27     USA
3  David   32      UK
4  Karen   41     USA

In [13]:
# Filter for rows where a condition is NOT true

df_filtered = df[ ~(df['Age'] > 25) ]
df_filtered

      Name  Age Country
0    Alice   24     USA
2  Charlie   22      UK